artillery.yml
config:
  target: "http://localhost:4000"
  phases:
    - duration: 60
      arrivalRate: 20
before:
  flow:
    - post:
        url: '/login'
        json:
          login: 'admin'
          password: 'admin'
        capture:
          - json: $.token
            as: token
scenarios:
  - name: "CRUD boards"
    flow:
      - post:
          url: "/boards"
          headers:
            authorization: "Bearer {{ token }}"
          json:
            title: "Autotest board"
            columns:
              - title: 'Backlog'
                order: 1
              - title: 'Sprint'
                order: 2
          capture:
            json: $.id
            as: boardId
      - get:
          url: "/boards"
          headers:
            authorization: "Bearer {{ token }}"
      - get:
          url: "/boards/{{ boardId }}"
          headers:
            authorization: "Bearer {{ token }}"
      - put:
          url: "/boards/{{ boardId }}"
          headers:
            authorization: "Bearer {{ token }}"
          json:
            title: "Autotest board updated"
            columns:
              - title: 'Backlog'
                order: 1
      - delete:
          url: "/boards/{{ boardId }}"
          headers:
            authorization: "Bearer {{ token }}"